# Series

In [2]:
from pandas import Series, DataFrame
import pandas as pd

In [7]:
list_data = [1,2,3,4,5]
list_name = ["a", "b", "c", "d", "e"]
example = Series(data = list_data, index= list_name, name="example_data")
# name : 시리즈 이름 설정
# dtype : 데이터타입

In [8]:
example

a    1
b    2
c    3
d    4
e    5
Name: example_data, dtype: int64

In [10]:
example["a"] # index 로 접근 가능

1

In [12]:
example.values # numpy 형태의 결과 반환

array([1, 2, 3, 4, 5])

In [13]:
example.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [14]:
# 재할당
example.name = 'Renamed'
example.index.name = "alphabet"

In [15]:
example

alphabet
a    1
b    2
c    3
d    4
e    5
Name: Renamed, dtype: int64

In [16]:
# key 값이 짧으면...
dict_data_1 = {'a' : 1, "b":2, "c":3}
indexes = ["a", "b", "c", "d"]

series_obj = Series(data = dict_data_1, index = indexes) # index 가 하나 더 길기 때문에 NaN으로 표기됨

In [18]:
series_obj

a    1.0
b    2.0
c    3.0
d    NaN
dtype: float64

In [20]:
type(example.values) # numpy 객체로 반환

numpy.ndarray

# Dataframe

In [4]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [8]:
raw_data = {'first_name': ["Jason", "Molly", "Tina", "Lake"], 'Last_Name': ['aaa','bbb','ccc','ddd'], "age":[42,52,36,50]}

In [9]:
DataFrame(raw_data)

  first_name Last_Name  age
0      Jason       aaa   42
1      Molly       bbb   52
2       Tina       ccc   36
3       Lake       ddd   50

In [10]:
DataFrame(raw_data, columns=["aa", "bb"]) # columns 추출하는 것

Empty DataFrame
Columns: [aa, bb]
Index: []

In [11]:
df = DataFrame(raw_data)

In [57]:
df.first_name # 데이터 호출

0    Jason
1    Molly
2     Tina
3     Lake
Name: first_name, dtype: object

In [58]:
df["first_name"] # 이렇게도 꺼낼 수 있다. 데이터다입 : pd.Series

0    Jason
1    Molly
2     Tina
3     Lake
Name: first_name, dtype: object

In [59]:
# row 를 뽑을 때.
# loc, iloc 사용

df.loc[1] # loc (인덱스의 키값으로 불러옴) : index의 이름으로 불러옴

first_name    Molly
Last_Name       bbb
age              52
Name: 1, dtype: object

In [60]:
df['Last_Name'].iloc[:1]#  : index가 몇 번째 까진지.. (절대위치 느낌)

0    aaa
Name: Last_Name, dtype: object

In [61]:
# column에 새로운 데이터 할당
df['age'] = np.array([42,52,36,50])

In [69]:
df['isOld'] = (df.age > 40)

In [71]:
df

  first_name Last_Name  age  isOld
0      Jason       aaa   42   True
1      Molly       bbb   52   True
2       Tina       ccc   36  False
3       Lake       ddd   50   True

In [73]:
# transpose
df.T

                0      1      2     3
first_name  Jason  Molly   Tina  Lake
Last_Name     aaa    bbb    ccc   ddd
age            42     52     36    50
isOld        True   True  False  True

In [75]:
df.values # 값 출력 = as_matrix

array([['Jason', 'aaa', 42, True],
       ['Molly', 'bbb', 52, True],
       ['Tina', 'ccc', 36, False],
       ['Lake', 'ddd', 50, True]], dtype=object)

In [77]:
# column삭제
def df.isOld

SyntaxError: invalid syntax (<ipython-input-77-b063cd3b36d2>, line 2)

# Selection and drop

In [14]:
df[["first_name", "Last_Name"]].head() # 여러 행을 가져오기

  first_name Last_Name
0      Jason       aaa
1      Molly       bbb
2       Tina       ccc
3       Lake       ddd

In [15]:
df[:3] # column 이름 없이 사용하면 row 기준 표시

  first_name Last_Name  age
0      Jason       aaa   42
1      Molly       bbb   52
2       Tina       ccc   36

In [18]:
df[df.age<40] # boolean index
# Series 이기 때문에 사용할 수 있다

  first_name Last_Name  age
2       Tina       ccc   36

In [21]:
df.iloc[:2,:2] # 인덱스 위에서 두개, column 두개

  first_name Last_Name
0      Jason       aaa
1      Molly       bbb

In [22]:
# 한 줄 삭제
df.drop(1)

  first_name Last_Name  age
0      Jason       aaa   42
2       Tina       ccc   36
3       Lake       ddd   50

In [23]:
# 여러 줄 삭제
df.drop([1,2,3])

  first_name Last_Name  age
0      Jason       aaa   42

In [27]:
# column 단위로..
df.drop("age", axis=1) # column 명을 써야 한다

  first_name Last_Name
0      Jason       aaa
1      Molly       bbb
2       Tina       ccc
3       Lake       ddd

# lambda, map, apply

In [30]:
f = lambda x, y:  x + y
f(1,4)

5

In [31]:
(lambda x:x+1)(5)

6

In [33]:
# map : Sequence 형 데이터를 인자로 받아서 element 마다 입력받은 함수를 적용하여 list 형태로 변환
ex = [1,2,3,4,5]
f = lambda x : x ** 2
list(map(f,ex)) # list 를 붙여야함

[1, 4, 9, 16, 25]

In [34]:
list(map(lambda x: x+5, ex))

[6, 7, 8, 9, 10]

In [35]:
s1 = Series(np.arange(10))

In [38]:
s1.map(lambda x : x ** 2) # Series도 map을 지원한다

0     0
1     1
2     4
3     9
4    16
5    25
6    36
7    49
8    64
9    81
dtype: int64

In [40]:
z = {1:'A', 2: 'B', 3: "c"}
s1.map(z) # 이런식으로 딕셔너리를 적용하기도 한다.

0    NaN
1      A
2      B
3      c
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

In [43]:
df.age.replace([1,2], ["a", "b"], inplace=False) # map과 기능상 동일하다

0    42
1    52
2    36
3    50
Name: age, dtype: int64

In [57]:
df2 = df
df2['num'] = np.arange(4)
df2 = df2[["age", "num"]]

In [59]:
f = lambda x : x.max() - x.min()
df2.apply(f) # apply 는 시리즈 전체가 들어감 (각 행 별로)

   age  num
0   52    3
1   36    0

In [61]:
f = lambda x : [x.max(), x.min(), x.sum()]
df2.apply(f) # 배열로도 반환이 가능함

   age  num
0   52    3
1   36    0
2  180    6

In [63]:
df2.applymap(lambda x : -x) # applymap은 각각 원소랑 동일하게 사용함(map과 비슷하다)

   age  num
0  -42    0
1  -52   -1
2  -36   -2
3  -50   -3

# Operation

In [66]:
s1 = Series(range(1,6), index=list("abcde"))
s2 = Series(range(5,10), index=list("cdefg"))

In [83]:
s1 + s2 # 인덱스가 같은 값으로 비교한다
# 단순히 더하면 coulmn 을 기준으로 계산한다

a     NaN
b     NaN
c     8.0
d    10.0
e    12.0
f     NaN
g     NaN
dtype: float64

In [70]:
s1.add(s2, fill_value=True) # 값을 채운다

a     2.0
b     3.0
c     8.0
d    10.0
e    12.0
f     9.0
g    10.0
dtype: float64

In [73]:
df1 = DataFrame(np.arange(9).reshape(3,3), columns=list("abc"))
df2 = DataFrame(np.arange(16).reshape(4,4), columns=list("abcd"))

In [74]:
df1.add(df2, fill_value=True)

      a     b     c     d
0   0.0   2.0   4.0   4.0
1   7.0   9.0  11.0   8.0
2  14.0  16.0  18.0  12.0
3  13.0  14.0  15.0  16.0

In [75]:
s3 = Series(np.arange(10,14), index=list("abcd"))

In [78]:
df1 + s3 # column 기준 broadcasting

    a   b   c   d
0  10  12  14 NaN
1  13  15  17 NaN
2  16  18  20 NaN

In [79]:
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [80]:
s3

a    10
b    11
c    12
d    13
dtype: int64

In [82]:
df.add(s3, axis=0) # axis를 적어 주면 그것이 기준, 단 index명을 기준으로 한다

  first_name Last_Name  age  num
0        NaN       NaN  NaN  NaN
1        NaN       NaN  NaN  NaN
2        NaN       NaN  NaN  NaN
3        NaN       NaN  NaN  NaN
a        NaN       NaN  NaN  NaN
b        NaN       NaN  NaN  NaN
c        NaN       NaN  NaN  NaN
d        NaN       NaN  NaN  NaN

# pandas built-in

In [85]:
df.describe() # 요약 정보를 보여주는 함수

             age       num
count   4.000000  4.000000
mean   45.000000  1.500000
std     7.393691  1.290994
min    36.000000  0.000000
25%    40.500000  0.750000
50%    46.000000  1.500000
75%    50.500000  2.250000
max    52.000000  3.000000

In [87]:
df.first_name.unique() # 유일한 값을 뽑아낸다

array(['Jason', 'Molly', 'Tina', 'Lake'], dtype=object)

In [89]:
np.array(dict(enumerate(df.first_name.unique()))) # 이렇게 값 별로 라벨을 뽑을 수 있다.

array({0: 'Jason', 1: 'Molly', 2: 'Tina', 3: 'Lake'}, dtype=object)

In [94]:
df2.sum() # column 별로 가능

a    24
b    28
c    32
d    36
dtype: int64

In [93]:
df2.sum(axis=1) # row 별로 가능

0     6
1    22
2    38
3    54
dtype: int64

In [95]:
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [98]:
df.isnull() # null(NaN)인지 체크

   first_name  Last_Name    age    num
0       False      False  False  False
1       False      False  False  False
2       False      False  False  False
3       False      False  False  False

In [100]:
df.isnull().sum() # null 값의 합

first_name    0
Last_Name     0
age           0
num           0
dtype: int64

In [103]:
df.sort_values(['age'], ascending=True) # 나이 순 정렬

  first_name Last_Name  age  num
2       Tina       ccc   36    2
0      Jason       aaa   42    0
3       Lake       ddd   50    3
1      Molly       bbb   52    1

In [105]:
df.cumsum() # 누적 sum

           first_name     Last_Name  age  num
0               Jason           aaa   42    0
1          JasonMolly        aaabbb   94    1
2      JasonMollyTina     aaabbbccc  130    3
3  JasonMollyTinaLake  aaabbbcccddd  180    6

In [107]:
df.age.corr(df.num) # 상관계수

0.13968605915391566

In [110]:
df2.corr() # 상관계수 출력

     a    b    c    d
a  1.0  1.0  1.0  1.0
b  1.0  1.0  1.0  1.0
c  1.0  1.0  1.0  1.0
d  1.0  1.0  1.0  1.0